MikroElektronika/core_packages/ARM/gcc_clang/def/hdsc/HC32F4A0PIHB/mcu.h
typedef struct {
    __IO uint32_t EMPUBRP;
    __IO uint32_t EMPUBWP;
    uint32_t RESERVED0[5];
    __IO uint32_t EMPUE;
    uint32_t RESERVED1[24];
} stc_mpu_ecr_bit_t;

typedef struct {
    __IO uint32_t OTSST;
    __IO uint32_t OTSCK;
    __IO uint32_t OTSIE;
    __IO uint32_t TSSTP;
    uint32_t RESERVED0[12];
} stc_ots_ctl_bit_t;

typedef struct {
    __IO uint32_t USBFS_DFB;
    __IO uint32_t USBFS_SOFEN;
    uint32_t RESERVED0[6];
    __IO uint32_t USBHS_DFB;
    __IO uint32_t USBHS_SOFEN;
    __IO uint32_t USBHS_FSPHYE;
    uint32_t RESERVED1[7];
    __IO uint32_t USBFS_NFE;
    uint32_t RESERVED2[7];
    __IO uint32_t USBHS_NFE;
    uint32_t RESERVED3[5];
} stc_peric_usb_syctlreg_bit_t;

typedef struct {
    uint32_t RESERVED0[1];
    __IO uint32_t SELMMC1;
    uint32_t RESERVED1[1];
    __IO uint32_t SELMMC2;
    uint32_t RESERVED2[28];
} stc_peric_sdioc_syctlreg_bit_t;

typedef struct {
    __IO uint32_t OPENP;
    uint32_t RESERVED0[31];
} stc_peric_nfc_stcr_bit_t;

typedef struct {
    uint32_t RESERVED0[2];
    __IO uint32_t NFCEN;
    uint32_t RESERVED1[29];
} stc_peric_nfc_enar_bit_t;

typedef struct {
    uint32_t RESERVED0[1];
    __IO uint32_t SMCEN;
    uint32_t RESERVED1[30];
} stc_peric_smc_enar_bit_t;

typedef struct {
    __IO uint32_t DMCEN;
    uint32_t RESERVED0[31];
} stc_peric_dmc_enar_bit_t;

typedef struct {
    uint32_t RESERVED0[2];
    __IO uint32_t USART1_NFE;
    uint32_t RESERVED1[29];
} stc_peric_usart1_nfc_bit_t;

typedef struct {
    uint32_t RESERVED0[8];
    __I  uint32_t PECC;
    uint32_t RESERVED1[23];
} stc_peric_nfc_stsr_bit_t;

typedef struct {
    __IO uint32_t SRAMH;
    uint32_t RESERVED0[3];
    __IO uint32_t SRAM1;
    __IO uint32_t SRAM2;
    __IO uint32_t SRAM3;
    __IO uint32_t SRAM4;
    uint32_t RESERVED1[2];
    __IO uint32_t SRAMB;
    uint32_t RESERVED2[2];
    __IO uint32_t KEY;
    __IO uint32_t DMA1;
    __IO uint32_t DMA2;
    __IO uint32_t FCM;
    __IO uint32_t AOS;
    __IO uint32_t CTC;
    __IO uint32_t MAU;
    __IO uint32_t AES;
    __IO uint32_t HASH;
    __IO uint32_t TRNG;
    __IO uint32_t CRC;
    __IO uint32_t DCU1;
    __IO uint32_t DCU2;
    __IO uint32_t DCU3;
    __IO uint32_t DCU4;
    __IO uint32_t DCU5;
    __IO uint32_t DCU6;
    __IO uint32_t DCU7;
    __IO uint32_t DCU8;
} stc_pwc_fcg0_bit_t;

typedef struct {
    __IO uint32_t CAN1;
    __IO uint32_t CAN2;
    __IO uint32_t ETHMAC;
    __IO uint32_t QSPI;
    __IO uint32_t I2C1;
    __IO uint32_t I2C2;
    __IO uint32_t I2C3;
    __IO uint32_t I2C4;
    __IO uint32_t I2C5;
    __IO uint32_t I2C6;
    __IO uint32_t SDIOC1;
    __IO uint32_t SDIOC2;
    __IO uint32_t I2S1;
    __IO uint32_t I2S2;
    __IO uint32_t I2S3;
    __IO uint32_t I2S4;
    __IO uint32_t SPI1;
    __IO uint32_t SPI2;
    __IO uint32_t SPI3;
    __IO uint32_t SPI4;
    __IO uint32_t SPI5;
    __IO uint32_t SPI6;
    __IO uint32_t USBFS;
    __IO uint32_t USBHS;
    __IO uint32_t FMAC1;
    __IO uint32_t FMAC2;
    __IO uint32_t FMAC3;
    __IO uint32_t FMAC4;
    uint32_t RESERVED0[4];
} stc_pwc_fcg1_bit_t;

typedef struct {
    __IO uint32_t TMR6_1;
    __IO uint32_t TMR6_2;
    __IO uint32_t TMR6_3;
    __IO uint32_t TMR6_4;
    __IO uint32_t TMR6_5;
    __IO uint32_t TMR6_6;
    __IO uint32_t TMR6_7;
    __IO uint32_t TMR6_8;
    __IO uint32_t TMR4_1;
    __IO uint32_t TMR4_2;
    __IO uint32_t TMR4_3;
    __IO uint32_t HRPWM;
    __IO uint32_t TMR0_1;
    __IO uint32_t TMR0_2;
    uint32_t RESERVED0[1];
    __IO uint32_t EMB;
    __IO uint32_t TMR2_1;
    __IO uint32_t TMR2_2;
    __IO uint32_t TMR2_3;
    __IO uint32_t TMR2_4;
    __IO uint32_t TMRA_1;
    __IO uint32_t TMRA_2;
    __IO uint32_t TMRA_3;
    __IO uint32_t TMRA_4;
    __IO uint32_t TMRA_5;
    __IO uint32_t TMRA_6;
    __IO uint32_t TMRA_7;
    __IO uint32_t TMRA_8;
    __IO uint32_t TMRA_9;
    __IO uint32_t TMRA_10;
    __IO uint32_t TMRA_11;
    __IO uint32_t TMRA_12;
} stc_pwc_fcg2_bit_t;

typedef struct {
    __IO uint32_t ADC1;
    __IO uint32_t ADC2;
    __IO uint32_t ADC3;
    __IO uint32_t CMBIAS;
    __IO uint32_t DAC1;
    __IO uint32_t DAC2;
    uint32_t RESERVED0[2];
    __IO uint32_t CMP12;
    __IO uint32_t CMP34;
    uint32_t RESERVED1[2];
    __IO uint32_t OTS;
    uint32_t RESERVED2[2];
    __IO uint32_t DVP;
    __IO uint32_t SMC;
    __IO uint32_t DMC;
    __IO uint32_t NFC;
    uint32_t RESERVED3[1];
    __IO uint32_t USART1;
    __IO uint32_t USART2;
    __IO uint32_t USART3;
    __IO uint32_t USART4;
    __IO uint32_t USART5;
    __IO uint32_t USART6;
    __IO uint32_t USART7;
    __IO uint32_t USART8;
    __IO uint32_t USART9;
    __IO uint32_t USART10;
    uint32_t RESERVED4[2];
} stc_pwc_fcg3_bit_t;

typedef struct {
    __IO uint32_t PRT0;
    uint32_t RESERVED0[31];
} stc_pwc_fcg0pc_bit_t;

typedef struct {
    __IO uint32_t VBTRSD;
    __IO uint32_t RAMVALID;
    __IO uint32_t RAMPDF;
    __IO uint32_t VBATDIVMONE;
    uint32_t RESERVED0[3];
    __IO uint32_t CSDIS;
} stc_pwc_vbatcr_bit_t;

typedef struct {
    uint32_t RESERVED0[4];
    __IO uint32_t WKOVF;
    uint32_t RESERVED1[2];
    __IO uint32_t WKTCE;
} stc_pwc_wktc2_bit_t;

typedef struct {
    uint32_t RESERVED0[7];
    __IO uint32_t PWDN;
} stc_pwc_pwrc0_bit_t;

typedef struct {
    uint32_t RESERVED0[2];
    __IO uint32_t VHRCSD;
    __IO uint32_t PDTS;
    uint32_t RESERVED1[4];
} stc_pwc_pwrc1_bit_t;

typedef struct {
    __IO uint32_t VBATREFSEL;
    __IO uint32_t VBATME;
    uint32_t RESERVED0[2];
    __IO uint32_t VBATMON;
    uint32_t RESERVED1[1];
    __IO uint32_t ADBUFS;
    __IO uint32_t ADBUFE;
} stc_pwc_pwrc4_bit_t;

typedef struct {
    __IO uint32_t EXVCCINEN;
    uint32_t RESERVED0[4];
    __IO uint32_t PVD1EN;
    __IO uint32_t PVD2EN;
    uint32_t RESERVED1[1];
} stc_pwc_pvdcr0_bit_t;

typedef struct {
    __IO uint32_t PVD1IRE;
    __IO uint32_t PVD1IRS;
    __IO uint32_t PVD1CMPOE;
    uint32_t RESERVED0[1];
    __IO uint32_t PVD2IRE;
    __IO uint32_t PVD2IRS;
    __IO uint32_t PVD2CMPOE;
    uint32_t RESERVED1[1];
} stc_pwc_pvdcr1_bit_t;

