MikroElektronika/core_packages/ARM/gcc_clang/def/hdsc/HC32F4A0PIHB/mcu.h
typedef struct {
    stc_usbhs_gvbuscfg_bit_t                 GVBUSCFG_b;
    uint32_t                                 RESERVED0[32];
    stc_usbhs_gahbcfg_bit_t                  GAHBCFG_b;
    stc_usbhs_gusbcfg_bit_t                  GUSBCFG_b;
    stc_usbhs_grstctl_bit_t                  GRSTCTL_b;
    stc_usbhs_gintsts_bit_t                  GINTSTS_b;
    stc_usbhs_gintmsk_bit_t                  GINTMSK_b;
    uint32_t                                 RESERVED1[448];
    stc_usbhs_glpmcfg_bit_t                  GLPMCFG_b;
    uint32_t                                 RESERVED2[7488];
    stc_usbhs_hcfg_bit_t                     HCFG_b;
    uint32_t                                 RESERVED3[480];
    stc_usbhs_hprt_bit_t                     HPRT_b;
    uint32_t                                 RESERVED4[1504];
    stc_usbhs_hcchar_bit_t                   HCCHAR0_b;
    stc_usbhs_hcsplt_bit_t                   HCSPLT0_b;
    stc_usbhs_hcint_bit_t                    HCINT0_b;
    stc_usbhs_hcintmsk_bit_t                 HCINTMSK0_b;
    stc_usbhs_hctsiz_bit_t                   HCTSIZ0_b;
    uint32_t                                 RESERVED5[96];
    stc_usbhs_hcchar_bit_t                   HCCHAR1_b;
    stc_usbhs_hcsplt_bit_t                   HCSPLT1_b;
    stc_usbhs_hcint_bit_t                    HCINT1_b;
    stc_usbhs_hcintmsk_bit_t                 HCINTMSK1_b;
    stc_usbhs_hctsiz_bit_t                   HCTSIZ1_b;
    uint32_t                                 RESERVED6[96];
    stc_usbhs_hcchar_bit_t                   HCCHAR2_b;
    stc_usbhs_hcsplt_bit_t                   HCSPLT2_b;
    stc_usbhs_hcint_bit_t                    HCINT2_b;
    stc_usbhs_hcintmsk_bit_t                 HCINTMSK2_b;
    stc_usbhs_hctsiz_bit_t                   HCTSIZ2_b;
    uint32_t                                 RESERVED7[96];
    stc_usbhs_hcchar_bit_t                   HCCHAR3_b;
    stc_usbhs_hcsplt_bit_t                   HCSPLT3_b;
    stc_usbhs_hcint_bit_t                    HCINT3_b;
    stc_usbhs_hcintmsk_bit_t                 HCINTMSK3_b;
    stc_usbhs_hctsiz_bit_t                   HCTSIZ3_b;
    uint32_t                                 RESERVED8[96];
    stc_usbhs_hcchar_bit_t                   HCCHAR4_b;
    stc_usbhs_hcsplt_bit_t                   HCSPLT4_b;
    stc_usbhs_hcint_bit_t                    HCINT4_b;
    stc_usbhs_hcintmsk_bit_t                 HCINTMSK4_b;
    stc_usbhs_hctsiz_bit_t                   HCTSIZ4_b;
    uint32_t                                 RESERVED9[96];
    stc_usbhs_hcchar_bit_t                   HCCHAR5_b;
    stc_usbhs_hcsplt_bit_t                   HCSPLT5_b;
    stc_usbhs_hcint_bit_t                    HCINT5_b;
    stc_usbhs_hcintmsk_bit_t                 HCINTMSK5_b;
    stc_usbhs_hctsiz_bit_t                   HCTSIZ5_b;
    uint32_t                                 RESERVED10[96];
    stc_usbhs_hcchar_bit_t                   HCCHAR6_b;
    stc_usbhs_hcsplt_bit_t                   HCSPLT6_b;
    stc_usbhs_hcint_bit_t                    HCINT6_b;
    stc_usbhs_hcintmsk_bit_t                 HCINTMSK6_b;
    stc_usbhs_hctsiz_bit_t                   HCTSIZ6_b;
    uint32_t                                 RESERVED11[96];
    stc_usbhs_hcchar_bit_t                   HCCHAR7_b;
    stc_usbhs_hcsplt_bit_t                   HCSPLT7_b;
    stc_usbhs_hcint_bit_t                    HCINT7_b;
    stc_usbhs_hcintmsk_bit_t                 HCINTMSK7_b;
    stc_usbhs_hctsiz_bit_t                   HCTSIZ7_b;
    uint32_t                                 RESERVED12[96];
    stc_usbhs_hcchar_bit_t                   HCCHAR8_b;
    stc_usbhs_hcsplt_bit_t                   HCSPLT8_b;
    stc_usbhs_hcint_bit_t                    HCINT8_b;
    stc_usbhs_hcintmsk_bit_t                 HCINTMSK8_b;
    stc_usbhs_hctsiz_bit_t                   HCTSIZ8_b;
    uint32_t                                 RESERVED13[96];
    stc_usbhs_hcchar_bit_t                   HCCHAR9_b;
    stc_usbhs_hcsplt_bit_t                   HCSPLT9_b;
    stc_usbhs_hcint_bit_t                    HCINT9_b;
    stc_usbhs_hcintmsk_bit_t                 HCINTMSK9_b;
    stc_usbhs_hctsiz_bit_t                   HCTSIZ9_b;
    uint32_t                                 RESERVED14[96];
    stc_usbhs_hcchar_bit_t                   HCCHAR10_b;
    stc_usbhs_hcsplt_bit_t                   HCSPLT10_b;
    stc_usbhs_hcint_bit_t                    HCINT10_b;
    stc_usbhs_hcintmsk_bit_t                 HCINTMSK10_b;
    stc_usbhs_hctsiz_bit_t                   HCTSIZ10_b;
    uint32_t                                 RESERVED15[96];
    stc_usbhs_hcchar_bit_t                   HCCHAR11_b;
    stc_usbhs_hcsplt_bit_t                   HCSPLT11_b;
    stc_usbhs_hcint_bit_t                    HCINT11_b;
    stc_usbhs_hcintmsk_bit_t                 HCINTMSK11_b;
    stc_usbhs_hctsiz_bit_t                   HCTSIZ11_b;
    uint32_t                                 RESERVED16[96];
    stc_usbhs_hcchar_bit_t                   HCCHAR12_b;
    stc_usbhs_hcsplt_bit_t                   HCSPLT12_b;
    stc_usbhs_hcint_bit_t                    HCINT12_b;
    stc_usbhs_hcintmsk_bit_t                 HCINTMSK12_b;
    stc_usbhs_hctsiz_bit_t                   HCTSIZ12_b;
    uint32_t                                 RESERVED17[96];
    stc_usbhs_hcchar_bit_t                   HCCHAR13_b;
    stc_usbhs_hcsplt_bit_t                   HCSPLT13_b;
    stc_usbhs_hcint_bit_t                    HCINT13_b;
    stc_usbhs_hcintmsk_bit_t                 HCINTMSK13_b;
    stc_usbhs_hctsiz_bit_t                   HCTSIZ13_b;
    uint32_t                                 RESERVED18[96];
    stc_usbhs_hcchar_bit_t                   HCCHAR14_b;
    stc_usbhs_hcsplt_bit_t                   HCSPLT14_b;
    stc_usbhs_hcint_bit_t                    HCINT14_b;
    stc_usbhs_hcintmsk_bit_t                 HCINTMSK14_b;
    stc_usbhs_hctsiz_bit_t                   HCTSIZ14_b;
    uint32_t                                 RESERVED19[96];
    stc_usbhs_hcchar_bit_t                   HCCHAR15_b;
    stc_usbhs_hcsplt_bit_t                   HCSPLT15_b;
    stc_usbhs_hcint_bit_t                    HCINT15_b;
    stc_usbhs_hcintmsk_bit_t                 HCINTMSK15_b;
    stc_usbhs_hctsiz_bit_t                   HCTSIZ15_b;
    uint32_t                                 RESERVED20[2144];
    stc_usbhs_dcfg_bit_t                     DCFG_b;
    stc_usbhs_dctl_bit_t                     DCTL_b;
    stc_usbhs_dsts_bit_t                     DSTS_b;
    uint32_t                                 RESERVED21[32];
    stc_usbhs_diepmsk_bit_t                  DIEPMSK_b;
    stc_usbhs_doepmsk_bit_t                  DOEPMSK_b;
    uint32_t                                 RESERVED22[192];
    stc_usbhs_dthrctl_bit_t                  DTHRCTL_b;
    uint32_t                                 RESERVED23[32];
    stc_usbhs_deachint_bit_t                 DEACHINT_b;
    stc_usbhs_deachintmsk_bit_t              DEACHINTMSK_b;
    uint32_t                                 RESERVED24[32];
    stc_usbhs_diepeachmsk1_bit_t             DIEPEACHMSK1_b;
    uint32_t                                 RESERVED25[480];
    stc_usbhs_doepeachmsk1_bit_t             DOEPEACHMSK1_b;
    uint32_t                                 RESERVED26[960];
    stc_usbhs_diepctl0_bit_t                 DIEPCTL0_b;
    uint32_t                                 RESERVED27[32];
    stc_usbhs_diepint_bit_t                  DIEPINT0_b;
    uint32_t                                 RESERVED28[160];
    stc_usbhs_diepctl_bit_t                  DIEPCTL1_b;
    uint32_t                                 RESERVED29[32];
    stc_usbhs_diepint_bit_t                  DIEPINT1_b;
    uint32_t                                 RESERVED30[160];
    stc_usbhs_diepctl_bit_t                  DIEPCTL2_b;
    uint32_t                                 RESERVED31[32];
    stc_usbhs_diepint_bit_t                  DIEPINT2_b;
    uint32_t                                 RESERVED32[160];
    stc_usbhs_diepctl_bit_t                  DIEPCTL3_b;
    uint32_t                                 RESERVED33[32];
    stc_usbhs_diepint_bit_t                  DIEPINT3_b;
    uint32_t                                 RESERVED34[160];
    stc_usbhs_diepctl_bit_t                  DIEPCTL4_b;
    uint32_t                                 RESERVED35[32];
    stc_usbhs_diepint_bit_t                  DIEPINT4_b;
    uint32_t                                 RESERVED36[160];
    stc_usbhs_diepctl_bit_t                  DIEPCTL5_b;
    uint32_t                                 RESERVED37[32];
    stc_usbhs_diepint_bit_t                  DIEPINT5_b;
    uint32_t                                 RESERVED38[160];
    stc_usbhs_diepctl_bit_t                  DIEPCTL6_b;
    uint32_t                                 RESERVED39[32];
    stc_usbhs_diepint_bit_t                  DIEPINT6_b;
    uint32_t                                 RESERVED40[160];
    stc_usbhs_diepctl_bit_t                  DIEPCTL7_b;
    uint32_t                                 RESERVED41[32];
    stc_usbhs_diepint_bit_t                  DIEPINT7_b;
    uint32_t                                 RESERVED42[160];
    stc_usbhs_diepctl_bit_t                  DIEPCTL8_b;
    uint32_t                                 RESERVED43[32];
    stc_usbhs_diepint_bit_t                  DIEPINT8_b;
    uint32_t                                 RESERVED44[160];
    stc_usbhs_diepctl_bit_t                  DIEPCTL9_b;
    uint32_t                                 RESERVED45[32];
    stc_usbhs_diepint_bit_t                  DIEPINT9_b;
    uint32_t                                 RESERVED46[160];
    stc_usbhs_diepctl_bit_t                  DIEPCTL10_b;
    uint32_t                                 RESERVED47[32];
    stc_usbhs_diepint_bit_t                  DIEPINT10_b;
    uint32_t                                 RESERVED48[160];
    stc_usbhs_diepctl_bit_t                  DIEPCTL11_b;
    uint32_t                                 RESERVED49[32];
    stc_usbhs_diepint_bit_t                  DIEPINT11_b;
    uint32_t                                 RESERVED50[160];
    stc_usbhs_diepctl_bit_t                  DIEPCTL12_b;
    uint32_t                                 RESERVED51[32];
    stc_usbhs_diepint_bit_t                  DIEPINT12_b;
    uint32_t                                 RESERVED52[160];
    stc_usbhs_diepctl_bit_t                  DIEPCTL13_b;
    uint32_t                                 RESERVED53[32];
    stc_usbhs_diepint_bit_t                  DIEPINT13_b;
    uint32_t                                 RESERVED54[160];
    stc_usbhs_diepctl_bit_t                  DIEPCTL14_b;
    uint32_t                                 RESERVED55[32];
    stc_usbhs_diepint_bit_t                  DIEPINT14_b;
    uint32_t                                 RESERVED56[160];
    stc_usbhs_diepctl_bit_t                  DIEPCTL15_b;
    uint32_t                                 RESERVED57[32];
    stc_usbhs_diepint_bit_t                  DIEPINT15_b;
    uint32_t                                 RESERVED58[160];
    stc_usbhs_doepctl0_bit_t                 DOEPCTL0_b;
    uint32_t                                 RESERVED59[32];
    stc_usbhs_doepint_bit_t                  DOEPINT0_b;
    uint32_t                                 RESERVED60[32];
    stc_usbhs_doeptsiz0_bit_t                DOEPTSIZ0_b;
    uint32_t                                 RESERVED61[96];
    stc_usbhs_doepctl_bit_t                  DOEPCTL1_b;
    uint32_t                                 RESERVED62[32];
    stc_usbhs_doepint_bit_t                  DOEPINT1_b;
    uint32_t                                 RESERVED63[160];
    stc_usbhs_doepctl_bit_t                  DOEPCTL2_b;
    uint32_t                                 RESERVED64[32];
    stc_usbhs_doepint_bit_t                  DOEPINT2_b;
    uint32_t                                 RESERVED65[160];
    stc_usbhs_doepctl_bit_t                  DOEPCTL3_b;
    uint32_t                                 RESERVED66[32];
    stc_usbhs_doepint_bit_t                  DOEPINT3_b;
    uint32_t                                 RESERVED67[160];
    stc_usbhs_doepctl_bit_t                  DOEPCTL4_b;
    uint32_t                                 RESERVED68[32];
    stc_usbhs_doepint_bit_t                  DOEPINT4_b;
    uint32_t                                 RESERVED69[160];
    stc_usbhs_doepctl_bit_t                  DOEPCTL5_b;
    uint32_t                                 RESERVED70[32];
    stc_usbhs_doepint_bit_t                  DOEPINT5_b;
    uint32_t                                 RESERVED71[160];
    stc_usbhs_doepctl_bit_t                  DOEPCTL6_b;
    uint32_t                                 RESERVED72[32];
    stc_usbhs_doepint_bit_t                  DOEPINT6_b;
    uint32_t                                 RESERVED73[160];
    stc_usbhs_doepctl_bit_t                  DOEPCTL7_b;
    uint32_t                                 RESERVED74[32];
    stc_usbhs_doepint_bit_t                  DOEPINT7_b;
    uint32_t                                 RESERVED75[160];
    stc_usbhs_doepctl_bit_t                  DOEPCTL8_b;
    uint32_t                                 RESERVED76[32];
    stc_usbhs_doepint_bit_t                  DOEPINT8_b;
    uint32_t                                 RESERVED77[160];
    stc_usbhs_doepctl_bit_t                  DOEPCTL9_b;
    uint32_t                                 RESERVED78[32];
    stc_usbhs_doepint_bit_t                  DOEPINT9_b;
    uint32_t                                 RESERVED79[160];
    stc_usbhs_doepctl_bit_t                  DOEPCTL10_b;
    uint32_t                                 RESERVED80[32];
    stc_usbhs_doepint_bit_t                  DOEPINT10_b;
    uint32_t                                 RESERVED81[160];
    stc_usbhs_doepctl_bit_t                  DOEPCTL11_b;
    uint32_t                                 RESERVED82[32];
    stc_usbhs_doepint_bit_t                  DOEPINT11_b;
    uint32_t                                 RESERVED83[160];
    stc_usbhs_doepctl_bit_t                  DOEPCTL12_b;
    uint32_t                                 RESERVED84[32];
    stc_usbhs_doepint_bit_t                  DOEPINT12_b;
    uint32_t                                 RESERVED85[160];
    stc_usbhs_doepctl_bit_t                  DOEPCTL13_b;
    uint32_t                                 RESERVED86[32];
    stc_usbhs_doepint_bit_t                  DOEPINT13_b;
    uint32_t                                 RESERVED87[160];
    stc_usbhs_doepctl_bit_t                  DOEPCTL14_b;
    uint32_t                                 RESERVED88[32];
    stc_usbhs_doepint_bit_t                  DOEPINT14_b;
    uint32_t                                 RESERVED89[160];
    stc_usbhs_doepctl_bit_t                  DOEPCTL15_b;
    uint32_t                                 RESERVED90[32];
    stc_usbhs_doepint_bit_t                  DOEPINT15_b;
    uint32_t                                 RESERVED91[2208];
    stc_usbhs_gcctl_bit_t                    GCCTL_b;
} bCM_USBHS_TypeDef;

